aaa 7
ability 4
able 25
absolutely 11
absolutly 3
access 4
accessories 2
accidentally 3
accompanying 3
active 2
actual 3
actually 8
adapter 4
add 9
added 6
adding 2
additional 2
additionally 2
advertised 11
advice 2
advise 2
afford 2
affordable 3
again 35
age 2
ago 21
agree 3
ahead 2
ahora 2
album 2
albums 6
alienware 2
allow 5
allows 3
almost 18
along 5
alot 10
already 11
alright 3
alternative 3
although 10
always 10
amazed 3
amazing 11
amazon 50
among 2
amount 3
annoying 5
another 36
answer 3
antenna 2
anymore 10
anyone 21
anything 18
anywhere 8
apart 4
apparently 3
appears 2
apple 46
apples 2
appreciate 2
appreciated 2
approximately 2
archos 9
arent 2
arm 3
armband 3
around 12
arrive 3
arrived 14
artist 7
artists 2
asin 3
ask 3
asking 3
atrac 6
attached 2
attempts 2
audible 4
audio 16
audiobooks 3
automatically 2
avail 2
available 11
average 5
avoid 8
away 16
awesome 18
awhile 3
awsome 2
b 5
baby 2
background 2
backlight 2
bad 50
band 3
bar 2
barely 3
bargain 2
based 2
basic 2
basically 3
basis 2
bass 2
batery 3
batteries 24
battery 113
beat 4
beautiful 7
beauty 2
became 2
been 43
before 32
begin 2
beginning 3
behind 2
being 11
believe 5
bells 2
below 2
belt 2
besides 2
best 35
bestbuy 5
better 67
between 9
beware 6
big 20
bigger 6
biggest 3
birthday 8
bit 17
black 5
blank 2
blind 2
body 2
book 4
bookmark 2
books 11
boot 3
both 27
bother 5
bottom 5
bought 119
bougth 2
box 11
br 4
brand 17
break 4
breaks 2
bright 3
broke 25
broken 14
brought 7
browser 4
bucks 3
buds 10
bugs 3
built 12
bulky 4
burn 2
business 4
button 12
buttons 12
buy 141
buyer 2
buying 28
buys 2
buzzing 2
cable 7
call 5
called 5
calling 2
calls 2
came 27
camera 5
cancelled 3
cannot 9
cant 39
capabilities 2
capability 2
capacity 5
car 9
carbon 5
card 17
cards 3
care 6
careful 4
carry 5
carrying 2
case 12
cases 3
causing 2
cd 8
cds 11
cent 2
certainly 2
change 10
changed 8
changing 5
charge 22
charged 3
charger 2
charging 5
cheap 21
cheaper 8
check 5
checked 2
china 3
choice 5
choose 4
christmas 32
circuit 2
city 2
clarity 4
class 3
clear 11
click 2
clip 6
clips 3
clix 3
close 6
clothing 2
club 2
cm 2
cmon 2
coby 3
color 10
com 13
combination 3
comes 12
comfortable 2
coming 4
compact 12
companies 3
company 19
compare 3
compared 5
compatibility 2
compatible 9
complain 2
complaint 3
complaints 6
complete 5
completely 15
computer 43
computers 4
con 4
condition 12
conect 2
confusing 5
connect 11
connected 4
connection 6
cons 4
consider 5
considered 2
considering 4
constant 2
constantly 5
contact 6
contacted 4
control 7
controls 14
convenient 3
convert 7
cool 19
coolest 2
copy 2
cord 6
correct 2
correctly 2
cost 13
costs 4
couldnt 16
couple 10
course 3
cover 5
coverage 2
cr 2
cracked 2
crap 5
crash 2
crashed 8
crashes 5
crazy 3
create 2
creative 45
crystal 2
cumbersome 3
customer 23
cute 6
d 4
dad 2
daily 4
damage 4
damaged 2
dark 2
data 3
date 2
daughter 16
daughters 3
days 39
de 5
dead 18
deal 13
death 2
december 2
decent 12
decided 5
defect 3
defective 11
definately 4
definitely 10
delete 7
deliver 2
delivered 5
delivery 5
dent 2
dented 2
describe 3
described 5
description 3
design 13
designed 5
desktop 2
despite 3
destroyed 2
detected 2
device 59
devices 5
did 57
didint 2
didnt 36
die 3
died 23
dies 5
difference 2
differences 2
different 17
difficult 13
difficulty 3
digging 3
digital 3
dim 2
direct 2
directions 5
directly 5
disapointed 2
disappointed 16
disappointing 2
disc 2
disconnect 2
discontinued 2
disk 11
display 13
displeased 2
dissapointing 2
dj 3
dmk 2
docking 2
does 59
doesnt 43
doing 6
dollar 4
dollars 2
done 4
dont 91
door 2
double 2
doubt 2
down 16
download 30
downloaded 13
downloading 7
downloads 5
downside 4
drag 5
drains 4
drawback 3
drive 21
driver 4
drivers 4
drives 5
driving 2
drop 4
dropped 8
dropping 2
drops 2
due 5
dumb 2
durabiulty 2
durable 6
during 8
dvd 6
dvds 2
dvr 5
e 12
each 8
ear 14
earbuds 8
earlier 2
earphones 4
ears 4
ease 2
easier 3
easiest 2
easily 13
easy 155
eat 2
ebay 3
effort 3
either 14
elegant 3
else 16
elsewhere 2
email 5
emails 2
emergency 2
end 8
ended 3
enjoy 14
enjoying 4
enough 20
entire 3
error 6
es 3
esp 2
especially 9
etc 14
eventually 5
ever 35
every 25
everybody 2
everyday 4
everyone 6
everything 22
exactly 11
excellent 39
except 7
excited 4
exercising 3
expansion 2
expect 5
expectations 3
expected 10
expense 2
expensive 10
experience 13
experienced 2
explains 2
explorer 3
extra 11
extremely 4
f 4
face 5
fact 12
fail 3
failed 8
failure 3
fair 5
fairly 2
faithful 2
fake 2
fall 5
family 4
fan 2
fancy 2
fantastic 3
far 24
fashion 2
fast 19
fault 5
faulty 2
favorite 4
feature 13
features 26
feel 7
fell 9
felt 3
few 23
fi 2
figure 9
figured 3
file 8
files 24
finally 5
finaly 2
find 21
finding 2
fine 24
finish 2
firmware 13
fit 6
fits 3
five 2
fix 10
fixed 9
flash 10
flaw 2
flawless 2
flawlessly 2
fm 32
folks 3
follow 3
followed 2
fooled 2
forever 8
forge 2
forget 2
format 10
formats 4
forward 5
found 18
four 6
fourth 2
fraction 2
fragile 4
free 10
freeze 5
freezes 7
freezing 8
friend 10
friendly 9
friends 4
frills 2
front 4
froze 20
frozen 4
frustrating 4
full 8
fully 2
fun 3
function 7
functional 2
functionality 2
functions 7
g 8
gadget 9
garbage 5
gave 13
gb 47
gen 5
general 2
generation 3
genre 2
gets 8
getting 25
gift 30
gifts 3
gig 7
gigabeat 3
gigs 5
girls 3
given 4
gives 3
giving 6
gizmo 2
glad 7
glitches 2
god 2
goes 6
going 22
gone 4
good 177
google 2
got 82
gotten 4
gp 2
graduation 2
granddaughter 2
grandson 2
graphics 3
great 275
greatest 4
ground 2
guess 11
guy 3
gym 10
h 4
had 161
half 15
hand 2
handles 2
handy 4
hang 4
happend 2
happened 4
happens 3
happier 5
happy 33
hard 36
harddrive 2
harder 2
hardly 4
hardware 5
has 128
hassle 3
hassles 2
hate 2
havent 14
having 28
hd 3
hdd 2
head 6
headphone 9
headphones 22
heads 3
hear 5
heard 8
heavier 2
heavy 2
held 2
help 20
helpful 2
here 13
hi 6
high 6
highest 2
highly 16
hit 4
hold 23
holder 2
holding 2
holds 18
home 6
honest 2
honor 2
hope 8
hopefully 2
horrible 8
horrid 3
host 2
hot 2
hour 10
hours 40
house 4
however 16
href 2
http 3
hubby 2
huge 4
hundreds 2
hung 2
hurt 4
husband 16
husbands 2
hype 4
iaudio 2
icon 2
icons 2
id 8
idea 7
ideal 3
ill 10
im 56
imac 2
immediately 5
import 2
important 2
impossible 5
impressed 5
impressive 2
improve 2
improvement 3
inch 2
included 5
including 4
indicate 2
indicates 2
inexpensive 5
info 2
information 4
install 13
installation 2
installed 5
instead 12
instructions 11
integrated 2
inteligente 2
interface 7
internal 2
internet 7
intuitive 2
ipod 202
ipods 25
iriver 13
isnt 14
issue 10
issues 4
item 74
items 12
itself 13
itunes 13
ive 42
j 3
jack 7
jammed 2
january 3
job 4
jod 2
jog 2
jogging 7
joy 3
june 2
junk 22
keep 11
kept 7
key 2
kid 4
kids 11
kills 2
kind 6
kinks 2
kit 3
knew 6
know 23
known 4
knows 4
l 2
la 4
labs 6
lack 2
lacking 2
lame 2
laptop 4
large 7
larger 3
last 27
lasted 6
lasts 7
late 2
later 11
latest 2
lcd 2
le 2
least 6
leave 2
left 11
lemon 3
length 2
less 19
let 7
lexar 4
library 2
lid 3
life 45
lifedrive 3
light 8
lighter 2
lightweight 4
like 115
liked 11
likely 3
likes 6
limited 5
line 12
list 3
listen 28
listened 2
listening 16
little 72
live 3
lived 2
ll 2
lnk 2
load 15
loaded 4
loading 6
local 2
locked 4
locks 2
lol 2
long 24
longer 11
looked 6
looking 14
looks 20
lose 3
lost 11
lot 35
lots 18
loud 3
louder 2
lousy 2
love 82
loved 13
loves 28
low 9
lower 2
lowest 3
loyal 3
luck 7
luckily 2
lucky 2
lyra 2
m 11
ma 2
mac 9
macbook 2
mach 3
machine 7
machines 2
machspeed 3
made 24
mail 5
mailed 2
main 3
major 2
make 28
makes 15
making 7
malfunction 2
man 2
manage 2
managed 2
manner 3
manual 9
manually 3
manufacturer 5
many 22
march 3
market 10
match 3
may 13
maybe 11
mb 18
mean 2
means 3
media 21
meets 2
memory 35
mention 4
menu 6
menues 2
menus 3
mere 2
mess 2
message 4
messed 4
mic 3
micro 4
microsoft 4
mid 2
might 8
miles 2
mind 4
mine 39
mini 11
minor 2
minutes 10
mishandled 2
misleading 2
miss 2
missed 2
missing 4
mistake 3
mobile 2
moda 2
mode 6
model 16
models 3
modes 3
mom 2
moment 2
money 70
monitor 2
month 25
months 63
more 78
move 4
movies 8
moving 2
mp 241
mpio 2
much 54
multiple 2
music 164
must 14
muvo 5
myself 7
n 5
name 2
nano 41
napster 10
navigate 7
navigation 7
nd 7
near 4
nearly 5
neat 2
necessary 2
need 34
needed 9
needs 12
negative 3
neither 4
never 61
new 67
news 3
next 15
nexus 2
nice 42
nifty 2
night 6
nightmare 2
nike 2
nitrus 2
no 145
noise 2
noises 2
nomad 9
non 4
nor 2
normal 4
not 356
note 2
noted 2
nothing 22
noticable 2
notice 3
nowhere 2
number 5
nw 3
obsolete 4
october 4
off 53
offer 2
offers 2
office 2
often 5
oh 3
ok 12
okay 5
old 23
oldest 2
olympus 3
once 18
ones 6
online 5
onto 16
open 2
opened 4
operate 10
operating 4
option 6
options 12
order 11
ordered 14
organize 4
original 4
os 4
osx 2
others 11
otherwise 6
outlook 2
output 2
outside 2
outstanding 3
overall 16
overpriced 2
own 19
owned 6
owner 2
p 13
pack 3
package 9
packaged 2
packages 3
packaging 4
packed 4
page 2
paid 5
pain 7
palm 7
paper 3
par 2
part 4
parts 6
past 8
pathetic 3
pause 2
pay 9
paying 2
pc 14
pd 2
pearl 2
peice 3
penny 2
people 17
per 5
perfect 28
perfectly 5
performance 3
performed 3
period 4
person 3
philips 7
phillips 2
phone 3
phones 5
photo 3
photos 8
pick 3
pics 5
picture 12
pictures 8
piece 27
pink 5
place 7
plan 5
plastic 4
play 41
playback 6
player 335
players 30
playing 10
playlists 4
plays 12
playsforsure 2
please 11
pleased 13
plenty 9
plug 8
plugged 4
plugs 3
plus 13
pocket 7
pod 7
podcast 2
podcasts 2
point 5
poor 8
poorly 7
port 3
portable 13
positive 2
post 3
power 18
powerful 2
prefer 2
present 7
presents 4
press 2
pretty 20
previous 13
price 86
priced 5
prices 5
primarily 2
print 2
pro 3
probably 7
problem 51
problems 39
process 3
product 236
products 18
program 7
programs 4
promised 5
prompt 2
promptly 3
prone 3
properly 8
proprietary 5
pros 3
protective 5
provided 3
public 3
punch 2
purchase 29
purchased 47
purchese 2
pure 2
put 25
puts 2
q 3
quality 75
quick 5
quickly 12
quiet 2
quit 6
quite 17
quot 2
r 2
radio 42
radioshack 2
rain 2
raised 2
ran 3
randomly 4
rate 6
rather 5
rca 6
rd 3
re 5
read 12
reader 2
reading 2
reads 2
ready 2
real 8
realized 2
really 67
realy 2
rear 2
reason 22
reasonable 4
reboot 2
rebooted 2
reccomend 2
receive 5
received 32
receiver 2
recently 6
reception 5
rechargable 2
recharge 5
rechargeable 4
recharger 2
recieved 8
recognize 3
recognized 4
recomend 9
recommend 41
recommended 5
reconditioned 2
record 17
recorder 13
recording 16
recordings 3
records 2
red 3
ref 3
reference 2
refund 22
refunded 4
refurbished 6
refused 2
refuses 3
regardless 2
regret 2
regular 5
release 2
released 6
reliable 7
reliably 2
reload 2
remained 2
remember 3
remote 2
removable 2
remove 5
repair 7
repaired 2
repairs 5
repeat 3
replace 18
replaceable 3
replaced 11
replacement 17
replacing 5
require 2
required 2
requirements 2
requiring 2
research 4
reset 12
resets 3
resetting 3
resistant 2
resolution 4
respond 4
responding 4
responsive 3
rest 3
restart 2
results 2
resume 2
retail 2
return 24
returned 25
returning 16
review 5
reviewer 3
reviewers 2
reviews 14
rhapsody 3
ridiculous 4
right 20
rio 20
rip 2
ripped 2
robe 2
rock 2
rocks 4
room 3
round 2
run 6
running 15
runs 4
s 25
said 20
sale 3
same 38
samsung 14
san 5
sandisk 23
sansa 12
satellite 2
satisfactory 2
satisfied 7
save 11
saved 2
saving 4
saw 4
saying 4
says 10
scanning 2
school 2
scratch 4
scratched 3
scratches 4
screen 63
scroll 5
sd 7
se 2
search 4
searched 2
searching 2
second 21
seconds 5
seeing 2
seem 3
seemed 3
seems 14
seen 6
selecting 2
sell 11
seller 4
sellers 3
send 13
sending 3
sent 24
september 2
serious 2
seriously 3
service 37
set 7
setting 4
settle 3
setup 3
seven 2
several 14
shame 2
shape 7
share 2
shell 2
shipped 14
shipping 15
shopping 2
short 10
shot 2
should 18
show 6
showing 2
shows 9
shuffle 14
shut 5
shuts 3
shutting 2
side 3
sign 2
signing 2
similar 3
simple 11
simply 2
since 26
single 5
sister 3
site 7
six 3
size 25
sized 2
skip 4
skips 6
sleek 3
slick 2
slightly 3
slow 11
small 54
smaller 8
smokes 2
snowboarding 2
software 54
sold 6
solid 4
solo 2
somebody 3
somehow 2
someone 8
something 27
sometimes 10
somewhat 2
son 29
song 19
songs 77
sons 2
sony 19
sonys 4
soon 7
soooo 2
sort 2
sound 107
sounding 2
sounds 13
source 2
sources 2
sp 2
space 14
span 2
speaker 5
speakers 2
special 2
specs 3
speed 2
spend 10
spending 3
spent 11
spoken 2
squeal 2
st 3
standard 2
stands 2
star 5
stars 6
start 15
started 12
starter 2
starting 3
starts 3
stated 2
static 2
station 3
stay 12
step 2
stereo 2
stick 6
still 55
stinks 2
stock 4
stolen 3
stop 6
stoped 3
stopped 32
stops 4
storage 14
store 14
storing 2
straight 2
strongly 2
stuck 5
stuff 8
stupid 4
style 2
substitute 2
such 8
sucks 5
suggest 6
suggested 3
summer 3
super 4
support 35
suppose 2
supposed 3
supposedly 2
sure 11
surprise 2
switch 5
switching 2
sync 8
syncing 3
syncs 2
system 9
t 6
table 3
take 17
takes 12
taking 4
talked 2
talking 3
tape 2
task 2
tear 2
tech 13
techie 2
technical 4
teenager 2
tell 7
term 2
terrible 12
terrific 4
tested 2
text 3
th 8
thank 8
thanks 13
thats 10
themselves 2
therefore 2
theres 4
thin 3
thing 68
things 18
thinking 4
thinks 2
third 4
those 10
though 16
thought 13
thousand 2
three 16
thrilled 3
through 18
throw 5
thru 3
thumb 2
thus 3
tic 5
till 4
time 73
timely 4
times 21
tiny 11
tivo 2
today 11
together 4
told 10
tomorrow 4
tons 6
too 47
took 13
top 3
toshiba 4
total 3
totally 9
touch 4
touched 3
toy 4
track 6
tracks 5
tranfer 2
transaction 2
transfer 20
transferred 2
trash 3
travel 3
tried 21
tries 3
trio 4
trip 2
trouble 9
truly 4
trust 2
try 12
trying 19
tuner 5
turn 24
turned 12
turning 4
turns 4
tv 10
twice 9
tx 2
type 5
types 2
typical 2
u 11
ugly 2
ultra 3
un 6
unable 7
under 3
understand 9
unfortunately 7
unit 55
units 10
unknow 2
unless 5
unstable 3
until 15
unwanted 2
update 5
updated 2
updates 2
upgrade 10
upgraded 2
upgrading 4
upload 5
uploading 2
ups 2
usable 2
usage 2
usb 34
used 44
useful 3
useless 11
user 16
users 2
uses 8
using 21
usually 4
v 10
value 12
variety 2
vcr 2
vehicle 2
vendor 2
versatile 2
version 8
versions 2
very 215
video 40
videos 13
view 3
viewing 2
vision 3
vista 3
voice 16
volume 16
w 6
wait 8
waited 3
waiting 3
walk 4
walking 7
walkman 6
wanna 3
wanted 19
wanting 2
wants 5
warned 3
warning 2
warranty 21
warrenty 4
wasnt 10
waste 15
wasted 4
wasting 2
watch 6
watching 5
ways 2
wear 7
web 12
website 9
week 25
weeks 38
weight 7
went 25
were 20
whatever 2
whats 6
whatsoever 3
wheel 6
whenever 2
where 15
while 35
whistles 2
white 3
whole 4
wholesalers 2
why 21
wi 2
wife 10
wifi 4
window 2
windows 28
wire 2
wise 2
wish 13
within 22
without 24
wma 6
wmas 2
wmp 8
wonder 2
wonderful 9
wonderfully 2
wont 33
word 4
worked 46
working 60
workout 6
works 84
world 3
worry 3
worse 2
worst 17
worth 34
worthless 3
woudnt 2
wouldnt 26
written 3
wrong 6
www 3
x 8
xm 3
xmas 6
xp 13
xtra 4
y 4
ya 2
yahoo 4
yard 2
years 7
yes 5
yet 14
youll 5
younger 2
youre 5
yourself 7
yp 2
yr 5
zen 40
zero 2
zune 9
